results/data/benchclient1/quarkus-worker-pool-46000-MEASURE.wrk2.out
Running 1m test @ http://benchserver4G1:8080/hello/Grahame
  4 threads and 100 connections
  Thread calibration: mean lat.: 48.616ms, rate sampling interval: 213ms
  Thread calibration: mean lat.: 47.655ms, rate sampling interval: 164ms
  Thread calibration: mean lat.: 46.976ms, rate sampling interval: 162ms
  Thread calibration: mean lat.: 50.249ms, rate sampling interval: 177ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    50.33ms  101.94ms   1.08s    94.68%
    Req/Sec    11.55k     1.46k   15.08k    63.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   28.22ms
 75.000%   44.16ms
 90.000%   85.57ms
 99.000%  603.14ms
 99.900%  966.14ms
 99.990%    1.04s 
 99.999%    1.07s 
100.000%    1.08s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.119     0.000000            1         1.00
       1.960     0.100000       229920         1.11
       9.167     0.200000       459742         1.25
      16.103     0.300000       689699         1.43
      22.303     0.400000       919558         1.67
      28.223     0.500000      1149553         2.00
      31.167     0.550000      1264282         2.22
      34.175     0.600000      1379216         2.50
      37.279     0.650000      1494710         2.86
      40.575     0.700000      1609714         3.33
      44.159     0.750000      1724433         4.00
      46.175     0.775000      1781400         4.44
      48.607     0.800000      1839395         5.00
      51.999     0.825000      1896270         5.71
      58.751     0.850000      1953666         6.67
      69.183     0.875000      2011284         8.00
      76.415     0.887500      2039854         8.89
      85.567     0.900000      2068670        10.00
      96.767     0.912500      2097371        11.43
     111.231     0.925000      2126047        13.33
     131.199     0.937500      2154820        16.00
     144.639     0.943750      2169196        17.78
     161.791     0.950000      2183517        20.00
     187.135     0.956250      2197906        22.86
     225.279     0.962500      2212268        26.67
     274.943     0.968750      2226656        32.00
     302.079     0.971875      2233820        35.56
     338.943     0.975000      2240964        40.00
     396.031     0.978125      2248141        45.71
     447.231     0.981250      2255341        53.33
     500.735     0.984375      2262517        64.00
     524.799     0.985938      2266157        71.11
     551.423     0.987500      2269710        80.00
     585.215     0.989062      2273298        91.43
     614.399     0.990625      2276906       106.67
     653.311     0.992188      2280472       128.00
     688.127     0.992969      2282262       142.22
     730.623     0.993750      2284076       160.00
     788.991     0.994531      2285853       182.86
     831.487     0.995313      2287659       213.33
     863.231     0.996094      2289458       256.00
     873.983     0.996484      2290390       284.44
     883.199     0.996875      2291239       320.00
     892.415     0.997266      2292161       365.71
     902.655     0.997656      2293054       426.67
     914.943     0.998047      2293964       512.00
     922.111     0.998242      2294405       568.89
     930.303     0.998437      2294847       640.00
     940.031     0.998633      2295277       731.43
     953.343     0.998828      2295739       853.33
     967.679     0.999023      2296176      1024.00
     973.823     0.999121      2296400      1137.78
     980.479     0.999219      2296640      1280.00
     986.623     0.999316      2296846      1462.86
     992.767     0.999414      2297084      1706.67
     998.399     0.999512      2297302      2048.00
    1001.983     0.999561      2297421      2275.56
    1005.055     0.999609      2297534      2560.00
    1008.127     0.999658      2297637      2925.71
    1012.223     0.999707      2297751      3413.33
    1017.343     0.999756      2297866      4096.00
    1019.903     0.999780      2297918      4551.11
    1023.487     0.999805      2297977      5120.00
    1026.559     0.999829      2298026      5851.43
    1030.655     0.999854      2298082      6826.67
    1035.263     0.999878      2298139      8192.00
    1038.335     0.999890      2298169      9102.22
    1040.895     0.999902      2298197     10240.00
    1043.967     0.999915      2298223     11702.86
    1047.551     0.999927      2298253     13653.33
    1050.623     0.999939      2298278     16384.00
    1052.671     0.999945      2298299     18204.44
    1053.695     0.999951      2298309     20480.00
    1055.743     0.999957      2298324     23405.71
    1057.791     0.999963      2298336     27306.67
    1059.839     0.999969      2298353     32768.00
    1060.863     0.999973      2298360     36408.89
    1061.887     0.999976      2298367     40960.00
    1062.911     0.999979      2298373     46811.43
    1063.935     0.999982      2298380     54613.33
    1064.959     0.999985      2298387     65536.00
    1064.959     0.999986      2298387     72817.78
    1065.983     0.999988      2298391     81920.00
    1067.007     0.999989      2298396     93622.86
    1067.007     0.999991      2298396    109226.67
    1069.055     0.999992      2298402    131072.00
    1069.055     0.999993      2298402    145635.56
    1070.079     0.999994      2298404    163840.00
    1071.103     0.999995      2298405    187245.71
    1072.127     0.999995      2298409    218453.33
    1072.127     0.999996      2298409    262144.00
    1073.151     0.999997      2298411    291271.11
    1073.151     0.999997      2298411    327680.00
    1073.151     0.999997      2298411    374491.43
    1074.175     0.999998      2298413    436906.67
    1074.175     0.999998      2298413    524288.00
    1075.199     0.999998      2298414    582542.22
    1075.199     0.999998      2298414    655360.00
    1075.199     0.999999      2298414    748982.86
    1076.223     0.999999      2298415    873813.33
    1076.223     0.999999      2298415   1048576.00
    1077.247     0.999999      2298416   1165084.44
    1077.247     0.999999      2298416   1310720.00
    1077.247     0.999999      2298416   1497965.71
    1077.247     0.999999      2298416   1747626.67
    1077.247     1.000000      2298416   2097152.00
    1078.271     1.000000      2298417   2330168.89
    1078.271     1.000000      2298417          inf
#[Mean    =       50.331, StdDeviation   =      101.941]
#[Max     =     1077.248, Total count    =      2298417]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2757066 requests in 1.00m, 241.90MB read
Requests/sec:  45921.46
Transfer/sec:      4.03MB